#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.example will be created
  + resource "azurerm_container_registry" "example" {
      + admin_enabled       = false
      + admin_password      = (sensitive value)
      + admin_username      = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + login_server        = (known after apply)
      + name                = (known after apply)
      + network_rule_set    = (known after apply)
      + resource_group_name = "myResourceGroup"
      + sku                 = "Basic"
      + tags                = {
          + "environment" = "dev"
        }
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "myResourceGroup"
      + tags     = {
          + "environment" = "dev"
        }
    }

  # random_string.example will be created
  + resource "random_string" "example" {
      + id          = (known after apply)
      + length      = 4
      + lower       = false
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `containers`*
